## Staging: ecs

**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`  


```terraform
Plan: 6 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show Plan</summary>

```terraform
module.unmasked_metrics.aws_cloudwatch_log_group.log: Refreshing state... [id=/aws/ecs/unmasked_metrics_ecs]
module.masked_metrics.aws_cloudwatch_log_group.log: Refreshing state... [id=/aws/ecs/masked_metrics_ecs]
aws_ecs_cluster.in_app_metrics: Refreshing state... [id=arn:aws:ecs:ca-central-1:005133826942:cluster/in-app-metrics]
aws_iam_role.container_execution_role: Refreshing state... [id=container_execution_role]
aws_iam_role.task_execution_role: Refreshing state... [id=metrics_task_execution_role]
aws_iam_role_policy_attachment.ce_cs: Refreshing state... [id=container_execution_role-20210614144933509400000001]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_policy.etl_policies will be created
  + resource "aws_iam_policy" "etl_policies" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "ETLTaskExecutionPolicies"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "dynamodb:Scan",
                          + "dynamodb:Query",
                          + "dynamodb:GetItem",
                          + "dynamodb:ConditionCheckItem",
                          + "dynamodb:BatchGetItem",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:dynamodb:ca-central-1:005133826942:table/aggregate_metrics"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "ecr:GetDownloadUrlForlayer",
                          + "ecr:BatchGetImage",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ecr:ca-central-1:005133826942:repository/covid-server/metrics-server"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:logs:ca-central-1:005133826942:log-group:/aws/ecs/unmasked_metrics_ecs:log-stream:*",
                          + "arn:aws:logs:ca-central-1:005133826942:log-group:/aws/ecs/unmasked_metrics_ecs",
                          + "arn:aws:logs:ca-central-1:005133826942:log-group:/aws/ecs/masked_metrics_ecs:log-stream:*",
                          + "arn:aws:logs:ca-central-1:005133826942:log-group:/aws/ecs/masked_metrics_ecs",
                        ]
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "ec2:DeleteNetworkInterface",
                          + "ec2:CreateNetworkInterface",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ec2:ca-central-1:005133826942:network-interface/*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = "ec2:DescribeNetworkInterfaces"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "s3:PutObjectAcl",
                          + "s3:PutObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::unmasked-metrics-snfsv-staging/*",
                          + "arn:aws:s3:::unmasked-metrics-snfsv-staging",
                          + "arn:aws:s3:::masked-metrics-snfsv-staging/*",
                          + "arn:aws:s3:::masked-metrics-snfsv-staging",
                        ]
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_iam_role_policy_attachment.te_etl_policies will be created
  + resource "aws_iam_role_policy_attachment" "te_etl_policies" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "metrics_task_execution_role"
    }

  # module.masked_metrics.aws_ecs_service.service will be created
  + resource "aws_ecs_service" "service" {
      + cluster                            = "arn:aws:ecs:ca-central-1:005133826942:cluster/in-app-metrics"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 50
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + health_check_grace_period_seconds  = 60
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "masked_metrics"
      + platform_version                   = "1.4.0"
      + propagate_tags                     = "SERVICE"
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "CostCentre" = "CovidShield"
        }
      + tags_all                           = {
          + "CostCentre" = "CovidShield"
        }
      + task_definition                    = (known after apply)
      + wait_for_steady_state              = false

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-090d16d17a0b6c2b1",
            ]
          + subnets          = [
              + "subnet-07f256fc1e9b65732",
            ]
        }
    }

  # module.masked_metrics.aws_ecs_task_definition.task_def will be created
  + resource "aws_ecs_task_definition" "task_def" {
      + arn                      = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + environment      = []
                  + image            = "hello-world"
                  + linuxParameters  = {
                      + capabilities = {
                          + drop = [
                              + "ALL",
                            ]
                        }
                    }
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/aws/ecs/masked_metrics_ecs"
                          + awslogs-region        = "ca-central-1"
                          + awslogs-stream-prefix = "ecs-masked-metrics"
                        }
                    }
                  + name             = "masked_metrics"
                  + portMappings     = [
                      + {
                          + containerPort = 8001
                        },
                    ]
                  + secrets          = []
                },
            ]
        )
      + cpu                      = "512"
      + execution_role_arn       = "arn:aws:iam::005133826942:role/container_execution_role"
      + family                   = "masked_metrics"
      + id                       = (known after apply)
      + memory                   = "1024"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + tags                     = {
          + "CostCentre" = "CovidShield"
        }
      + tags_all                 = {
          + "CostCentre" = "CovidShield"
        }
      + task_role_arn            = "arn:aws:iam::005133826942:role/metrics_task_execution_role"
    }

  # module.unmasked_metrics.aws_ecs_service.service will be created
  + resource "aws_ecs_service" "service" {
      + cluster                            = "arn:aws:ecs:ca-central-1:005133826942:cluster/in-app-metrics"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 50
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + health_check_grace_period_seconds  = 60
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "unmasked_metrics"
      + platform_version                   = "1.4.0"
      + propagate_tags                     = "SERVICE"
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "CostCentre" = "CovidShield"
        }
      + tags_all                           = {
          + "CostCentre" = "CovidShield"
        }
      + task_definition                    = (known after apply)
      + wait_for_steady_state              = false

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-090d16d17a0b6c2b1",
            ]
          + subnets          = [
              + "subnet-07f256fc1e9b65732",
            ]
        }
    }

  # module.unmasked_metrics.aws_ecs_task_definition.task_def will be created
  + resource "aws_ecs_task_definition" "task_def" {
      + arn                      = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + environment      = []
                  + image            = "hello-world"
                  + linuxParameters  = {
                      + capabilities = {
                          + drop = [
                              + "ALL",
                            ]
                        }
                    }
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/aws/ecs/unmasked_metrics_ecs"
                          + awslogs-region        = "ca-central-1"
                          + awslogs-stream-prefix = "ecs-unmasked-metrics"
                        }
                    }
                  + name             = "unmasked_metrics"
                  + portMappings     = [
                      + {
                          + containerPort = 8001
                        },
                    ]
                  + secrets          = []
                },
            ]
        )
      + cpu                      = "512"
      + execution_role_arn       = "arn:aws:iam::005133826942:role/container_execution_role"
      + family                   = "unmasked_metrics"
      + id                       = (known after apply)
      + memory                   = "1024"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + tags                     = {
          + "CostCentre" = "CovidShield"
        }
      + tags_all                 = {
          + "CostCentre" = "CovidShield"
        }
      + task_role_arn            = "arn:aws:iam::005133826942:role/metrics_task_execution_role"
    }

Plan: 6 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

This plan was saved to: /home/runner/work/covid-alert-metrics-terraform/covid-alert-metrics-terraform/tfplan.binary

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/runner/work/covid-alert-metrics-terraform/covid-alert-metrics-terraform/tfplan.binary"
```
</details>